Revit 2027 API
EnergyDataSettings.AnalysisType Property
 The type of analysis mode.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AnalysisMode AnalysisType { get; set; }
Public Property AnalysisType As AnalysisMode
	Get
	Set
public:
property AnalysisMode AnalysisType {
	AnalysisMode get ();
	void set (AnalysisMode value);
}
member AnalysisType : AnalysisMode with get, set
Property Value
AnalysisMode
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The analysis type does not fall within an appropriate range.
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace